In [1]:
people = {
    "first_name":["Duyen le","Duyen le","NaN"],
    "last_name":"huu",
    "sdt":["0123","1234","3456"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1   Duyen le       huu  1234
2        NaN       huu  3456

In [5]:
df.sdt

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [6]:
df['sdt']

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [7]:
df[['sdt','first_name']]

    sdt first_name
0  0123   Duyen le
1  1234   Duyen le
2  3456        NaN

In [8]:
df.columns

Index(['first_name', 'last_name', 'sdt'], dtype='object')

In [9]:
df.iloc[[0,1],2]

0    0123
1    1234
Name: sdt, dtype: object

In [10]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1   Duyen le       huu  1234
2        NaN       huu  3456

In [11]:
df.loc[[0,2],"sdt"]

0    0123
2    3456
Name: sdt, dtype: object

In [12]:
df.set_index('sdt',inplace=True)

In [13]:
df

     first_name last_name
sdt
0123   Duyen le       huu
1234   Duyen le       huu
3456        NaN       huu

In [14]:
df.index

Index(['0123', '1234', '3456'], dtype='object', name='sdt')

In [15]:
df.columns

Index(['first_name', 'last_name'], dtype='object')

In [16]:
df.reset_index(inplace=True)

In [17]:
df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [18]:
df["first_name"] == "Duyen le"

0     True
1     True
2    False
Name: first_name, dtype: bool

In [19]:
filt = (df["first_name"] == "Duyen le") | (df["sdt"] == "3456")

In [20]:
df[filt]

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [21]:
df.loc[~filt,"sdt"]

Series([], Name: sdt, dtype: object)

In [22]:
df.columns

Index(['sdt', 'first_name', 'last_name'], dtype='object')

In [23]:
df.columns = [x.upper() for x in df.columns]
df.columns = [x.lower() for x in df.columns]

df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [24]:
df.columns = df.columns.str.replace(' ',"_")
df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [25]:
df.rename(columns = {"fullname":"full_name","last_name":"middle_name"},inplace =True )

In [26]:
df

    sdt first_name middle_name
0  0123   Duyen le         huu
1  1234   Duyen le         huu
2  3456        NaN         huu

In [27]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.rename(columns={"full_name":"first_name"},inplace = True)

In [29]:
df.loc[0,['full_name','middle_name','first_name']] = ["fullname","middle","first_name"]
df

    sdt  first_name middle_name full_name
0  0123  first_name      middle  fullname
1  1234    Duyen le         huu       NaN
2  3456         NaN         huu       NaN

In [30]:
filt = (df['sdt'] > "1")

In [31]:
filt

0    False
1     True
2     True
Name: sdt, dtype: bool

In [32]:
df[filt]

    sdt first_name middle_name full_name
1  1234   Duyen le         huu       NaN
2  3456        NaN         huu       NaN

In [33]:
df.loc[filt,"midde_name"] = "hihi"

In [34]:
df['first_name'] = df['first_name'].str.lower()

In [35]:
df

    sdt  first_name middle_name full_name midde_name
0  0123  first_name      middle  fullname        NaN
1  1234    duyen le         huu       NaN       hihi
2  3456         nan         huu       NaN       hihi

In [36]:
 df['sdt'].apply(len)

0    4
1    4
2    4
Name: sdt, dtype: int64

In [37]:
def upperString(first_name):
    return first_name.upper();

In [41]:
df['first_name'] = df['first_name'].apply(upperString)
df

    sdt  first_name middle_name full_name midde_name
0  0123  FIRST_NAME      middle  fullname        NaN
1  1234    DUYEN LE         huu       NaN       hihi
2  3456         NAN         huu       NaN       hihi

In [42]:
df['first_name'] = df['first_name'].apply(lambda x : x.lower())
df

    sdt  first_name middle_name full_name midde_name
0  0123  first_name      middle  fullname        NaN
1  1234    duyen le         huu       NaN       hihi
2  3456         nan         huu       NaN       hihi

In [46]:
df.apply(len,axis ="columns")
df.apply(len,axis ="rows")

sdt            3
first_name     3
middle_name    3
full_name      3
midde_name     3
dtype: int64